redis/redis-architecture.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-25 三 16:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>redis部署架构选择</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="刘尚亮" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">redis部署架构选择</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org28eb6ac">1. 概览</a></li>
<li><a href="#org5506cb9">2. 单例</a></li>
<li><a href="#org0d5fe7b">3. 单机多实例</a>
<ul>
<li><a href="#org008943c">3.1. 目的</a></li>
<li><a href="#org424a762">3.2. 操作</a></li>
</ul>
</li>
<li><a href="#orge512b02">4. 主从</a>
<ul>
<li><a href="#org67a003c">4.1. 目的</a></li>
<li><a href="#org4310b27">4.2. 注意事项</a></li>
</ul>
</li>
<li><a href="#org2a61162">5. Sentinel</a>
<ul>
<li><a href="#orgf1f3e7d">5.1. 目的</a></li>
<li><a href="#org4be8d7f">5.2. 作用</a></li>
<li><a href="#orgfc22270">5.3. 注意事项</a></li>
</ul>
</li>
<li><a href="#org0ff2722">6. cluster</a>
<ul>
<li><a href="#org89dade2">6.1. 目的</a></li>
<li><a href="#org6fd6020">6.2. 注意事项</a></li>
</ul>
</li>
<li><a href="#org32a5e8e">7. 如何构建高可用的分布式 redis 服务？</a></li>
<li><a href="#org6b52e9d">8. Client</a></li>
<li><a href="#orgdab3e2d">9. books</a>
<ul>
<li><a href="#org8e7a4be">9.1. 入门</a></li>
<li><a href="#orgf175ad0">9.2. 高级</a></li>
<li><a href="#org46bf96c">9.3. 实践</a></li>
<li><a href="#org5cd38b2">9.4. 原理</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org28eb6ac" class="outline-2">
<h2 id="org28eb6ac"><span class="section-number-2">1</span> 概览</h2>
</div>

<div id="outline-container-org5506cb9" class="outline-2">
<h2 id="org5506cb9"><span class="section-number-2">2</span> 单例</h2>
</div>

<div id="outline-container-org0d5fe7b" class="outline-2">
<h2 id="org0d5fe7b"><span class="section-number-2">3</span> 单机多实例</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org008943c" class="outline-3">
<h3 id="org008943c"><span class="section-number-3">3.1</span> 目的</h3>
<div class="outline-text-3" id="text-3-1">
<p>
单个 redis 实例占用资源很少，为了充分利用单机性能，可在单机上部署多个 redis 实例。
</p>
</div>
</div>
<div id="outline-container-org424a762" class="outline-3">
<h3 id="org424a762"><span class="section-number-3">3.2</span> 操作</h3>
<div class="outline-text-3" id="text-3-2">
<p>
单个实例的配置文件（redis-6380.conf）做如下修改：
</p>

<pre class="example">
pidfile /tmp/redis-server-6380.pid
port 6380
dir /tmp/redis-6380/
logfile /tmp/redis-server-6380.log
</pre>
<p>
然后启动服务即可：
</p>
<div class="org-src-container">
<pre class="src src-sh">redis-server redis-6380.conf
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge512b02" class="outline-2">
<h2 id="orge512b02"><span class="section-number-2">4</span> 主从</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org67a003c" class="outline-3">
<h3 id="org67a003c"><span class="section-number-3">4.1</span> 目的</h3>
<div class="outline-text-3" id="text-4-1">
<p>
单个实例存在以下问题：
</p>
<ul class="org-ul">
<li>单点故障风险，主从结构中主宕机之后，从上的数据还可以保留。</li>
<li>性能瓶颈，通过主从可以分担查询压力，进行读写分离。</li>
</ul>
</div>
</div>

<div id="outline-container-org4310b27" class="outline-3">
<h3 id="org4310b27"><span class="section-number-3">4.2</span> 注意事项</h3>
<div class="outline-text-3" id="text-4-2">
<p>
如果 master 没有设置持久化，当 master 重启之后，slave 的数据有可能会被清空。所以这种情况下，应该禁止 master 自动重启。
</p>

<p>
redis4.0 之前的可写从不能不能正确处理过期的 key。（writable slaves before version 4.0 were incapable of expiring keys with a time to live set.）
</p>

<p>
从 redis 4.0 开始，从上的写操作指示本地写，不会扩散到下一层的从上。（since Redis 4.0 slave writes are only local, and are not propagated to sub-slaves attached to the instance.）
</p>
</div>
</div>
</div>

<div id="outline-container-org2a61162" class="outline-2">
<h2 id="org2a61162"><span class="section-number-2">5</span> Sentinel</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgf1f3e7d" class="outline-3">
<h3 id="orgf1f3e7d"><span class="section-number-3">5.1</span> 目的</h3>
<div class="outline-text-3" id="text-5-1">
<p>
主从结构中主宕机之后，后续的请求不能继续处理，不利于故障恢复。
</p>
</div>
</div>
<div id="outline-container-org4be8d7f" class="outline-3">
<h3 id="org4be8d7f"><span class="section-number-3">5.2</span> 作用</h3>
</div>


<div id="outline-container-orgfc22270" class="outline-3">
<h3 id="orgfc22270"><span class="section-number-3">5.3</span> 注意事项</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>down-after-milliseconds 表示 redis 实例失联时常</li>
<li>parallel-syncs 表示在执行</li>
<li>从挂了怎么办？</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0ff2722" class="outline-2">
<h2 id="org0ff2722"><span class="section-number-2">6</span> cluster</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org89dade2" class="outline-3">
<h3 id="org89dade2"><span class="section-number-3">6.1</span> 目的</h3>
<div class="outline-text-3" id="text-6-1">
<p>
单个实例不能存储所有的数据，需要一个分布式的 redis 存储。
</p>
</div>
</div>
<div id="outline-container-org6fd6020" class="outline-3">
<h3 id="org6fd6020"><span class="section-number-3">6.2</span> 注意事项</h3>
</div>
</div>

<div id="outline-container-org32a5e8e" class="outline-2">
<h2 id="org32a5e8e"><span class="section-number-2">7</span> 如何构建高可用的分布式 redis 服务？</h2>
<div class="outline-text-2" id="text-7">
<p>
两个要点：
</p>
<ul class="org-ul">
<li>分布式，存储大量数据，没有性能瓶颈。</li>
<li>高可用，故障恢复。</li>
</ul>
</div>
</div>

<div id="outline-container-org6b52e9d" class="outline-2">
<h2 id="org6b52e9d"><span class="section-number-2">8</span> Client</h2>
</div>

<div id="outline-container-orgdab3e2d" class="outline-2">
<h2 id="orgdab3e2d"><span class="section-number-2">9</span> books</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org8e7a4be" class="outline-3">
<h3 id="org8e7a4be"><span class="section-number-3">9.1</span> 入门</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li><a href="https://book.douban.com/subject/24522045/">redis 入门指南</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf175ad0" class="outline-3">
<h3 id="orgf175ad0"><span class="section-number-3">9.2</span> 高级</h3>
</div>
<div id="outline-container-org46bf96c" class="outline-3">
<h3 id="org46bf96c"><span class="section-number-3">9.3</span> 实践</h3>
<div class="outline-text-3" id="text-9-3">
<ul class="org-ul">
<li><a href="https://book.douban.com/subject/26612779/">redis 实战</a></li>
</ul>
</div>
</div>
<div id="outline-container-org5cd38b2" class="outline-3">
<h3 id="org5cd38b2"><span class="section-number-3">9.4</span> 原理</h3>
<div class="outline-text-3" id="text-9-4">
<ul class="org-ul">
<li><a href="https://book.douban.com/subject/25900156/">redis 设计与实现</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 刘尚亮</p>
<p class="email">Email: <a href="mailto:phenix3443@gmail.com">phenix3443@gmail.com</a></p>
<p class="date">Created: 2020-03-25 三 16:17</p>
<p class="validation"></p>
</div>
</body>
</html>
